==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
├─Sequential: 1-1                        [-1, 512, 2, 2]           --
|    └─Conv2d: 2-1                       [-1, 64, 32, 32]          1,792
|    └─BatchNorm2d: 2-2                  [-1, 64, 32, 32]          128
|    └─ReLU: 2-3                         [-1, 64, 32, 32]          --
|    └─Conv2d: 2-4                       [-1, 64, 32, 32]          36,928
|    └─BatchNorm2d: 2-5                  [-1, 64, 32, 32]          128
|    └─ReLU: 2-6                         [-1, 64, 32, 32]          --
|    └─MaxPool2d: 2-7                    [-1, 64, 16, 16]          --
|    └─Conv2d: 2-8                       [-1, 128, 16, 16]         73,856
|    └─BatchNorm2d: 2-9                  [-1, 128, 16, 16]         256
|    └─ReLU: 2-10                        [-1, 128, 16, 16]         --
|    └─Conv2d: 2-11                      [-1, 128, 16, 16]         147,584
|    └─BatchNorm2d: 2-12                 [-1, 128, 16, 16]         256
|    └─ReLU: 2-13                        [-1, 128, 16, 16]         --
|    └─MaxPool2d: 2-14                   [-1, 128, 8, 8]           --
|    └─Conv2d: 2-15                      [-1, 256, 8, 8]           295,168
|    └─BatchNorm2d: 2-16                 [-1, 256, 8, 8]           512
|    └─ReLU: 2-17                        [-1, 256, 8, 8]           --
|    └─Conv2d: 2-18                      [-1, 256, 8, 8]           590,080
|    └─BatchNorm2d: 2-19                 [-1, 256, 8, 8]           512
|    └─ReLU: 2-20                        [-1, 256, 8, 8]           --
|    └─MaxPool2d: 2-21                   [-1, 256, 4, 4]           --
|    └─Conv2d: 2-22                      [-1, 512, 4, 4]           1,180,160
|    └─BatchNorm2d: 2-23                 [-1, 512, 4, 4]           1,024
|    └─ReLU: 2-24                        [-1, 512, 4, 4]           --
|    └─Conv2d: 2-25                      [-1, 512, 4, 4]           2,359,808
|    └─BatchNorm2d: 2-26                 [-1, 512, 4, 4]           1,024
|    └─ReLU: 2-27                        [-1, 512, 4, 4]           --
|    └─MaxPool2d: 2-28                   [-1, 512, 2, 2]           --
├─Sequential: 1-2                        [-1, 10]                  --
|    └─Linear: 2-29                      [-1, 4096]                8,392,704
|    └─ReLU: 2-30                        [-1, 4096]                --
|    └─Dropout: 2-31                     [-1, 4096]                --
|    └─Linear: 2-32                      [-1, 4096]                16,781,312
|    └─ReLU: 2-33                        [-1, 4096]                --
|    └─Dropout: 2-34                     [-1, 4096]                --
|    └─Linear: 2-35                      [-1, 10]                  40,970
==========================================================================================
Total params: 29,904,202
Trainable params: 29,904,202
Non-trainable params: 0
Total mult-adds (M): 264.49
==========================================================================================
Input size (MB): 0.01
Forward/backward pass size (MB): 3.81
Params size (MB): 114.08
Estimated Total Size (MB): 117.90
==========================================================================================
